{
  "char": {
    "c2i": {
      "<PAD>": 0,
      "<UNK>": 1,
      "a": 2,
      "b": 3,
      "á": 4,
      "ç": 5,
      "í": 6,
      "s": 7,
      "c": 8,
      "t": 9,
      "e": 10,
      "i": 11,
      "r": 12,
      "o": 13,
      "x": 14,
      "h": 15,
      "l": 16,
      "d": 17,
      "â": 18,
      "n": 19,
      "u": 20,
      "f": 21,
      "m": 22,
      "-": 23,
      "j": 24,
      "v": 25,
      "ã": 26,
      "é": 27,
      "z": 28,
      "õ": 29,
      "ô": 30,
      "g": 31,
      "ê": 32,
      "ó": 33,
      "p": 34,
      "ú": 35,
      "q": 36,
      "ü": 37,
      "à": 38
    },
    "i2c": {
      "0": "<PAD>",
      "1": "<UNK>",
      "2": "a",
      "3": "b",
      "4": "á",
      "5": "ç",
      "6": "í",
      "7": "s",
      "8": "c",
      "9": "t",
      "10": "e",
      "11": "i",
      "12": "r",
      "13": "o",
      "14": "x",
      "15": "h",
      "16": "l",
      "17": "d",
      "18": "â",
      "19": "n",
      "20": "u",
      "21": "f",
      "22": "m",
      "23": "-",
      "24": "j",
      "25": "v",
      "26": "ã",
      "27": "é",
      "28": "z",
      "29": "õ",
      "30": "ô",
      "31": "g",
      "32": "ê",
      "33": "ó",
      "34": "p",
      "35": "ú",
      "36": "q",
      "37": "ü",
      "38": "à"
    }
  },
  "phoneme": {
    "p2i": {
      "<PAD>": 0,
      "<UNK>": 1,
      "<EOS>": 2,
      "a": 3,
      "ˈ": 4,
      "b": 5,
      "s": 6,
      "i": 7,
      "ə": 8,
      "k": 9,
      "t": 10,
      "e": 11,
      "y": 12,
      "ɾ": 13,
      "ʊ": 14,
      "ʃ": 15,
      "w": 16,
      "d": 17,
      "ʒ": 18,
      "ɪ": 19,
      "ã": 20,
      "n": 21,
      "ĩ": 22,
      "u": 23,
      "f": 24,
      "o": 25,
      "x": 26,
      "m": 27,
      "ẽ": 28,
      "ʊ̃": 29,
      "l": 30,
      "v": 31,
      "õ": 32,
      "ỹ": 33,
      "ɛ": 34,
      "z": 35,
      "ɲ": 36,
      "ɔ": 37,
      "ɡ": 38,
      "ɣ": 39,
      "ʎ": 40,
      "p": 41,
      "ũ": 42
    },
    "i2p": {
      "0": "<PAD>",
      "1": "<UNK>",
      "2": "<EOS>",
      "3": "a",
      "4": "ˈ",
      "5": "b",
      "6": "s",
      "7": "i",
      "8": "ə",
      "9": "k",
      "10": "t",
      "11": "e",
      "12": "y",
      "13": "ɾ",
      "14": "ʊ",
      "15": "ʃ",
      "16": "w",
      "17": "d",
      "18": "ʒ",
      "19": "ɪ",
      "20": "ã",
      "21": "n",
      "22": "ĩ",
      "23": "u",
      "24": "f",
      "25": "o",
      "26": "x",
      "27": "m",
      "28": "ẽ",
      "29": "ʊ̃",
      "30": "l",
      "31": "v",
      "32": "õ",
      "33": "ỹ",
      "34": "ɛ",
      "35": "z",
      "36": "ɲ",
      "37": "ɔ",
      "38": "ɡ",
      "39": "ɣ",
      "40": "ʎ",
      "41": "p",
      "42": "ũ"
    }
  }
}